In [27]:
import pandas as pd
import numpy as np
incomplete_df = pd.DataFrame({'id': [1,2,3,2,2,3,1,1,1,2,4],
                               'type': ['one', 'one', 'two', 'three', 'two', 'three', 'one', 'two', 'one', 'three','one'],
                          'amount': [345,928,np.NAN,645,113,942,np.NAN,539,np.NAN,814,np.NAN] 
                          }, columns=['id','type','amount'])
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two     NaN
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one     NaN
7    1    two   539.0
8    1    one     NaN
9    2  three   814.0
10   4    one     NaN

Use the median for NaN values

In [28]:
incomplete_df['amount'].fillna(incomplete_df["amount"].median())

0     345.0
1     928.0
2     645.0
3     645.0
4     113.0
5     942.0
6     645.0
7     539.0
8     645.0
9     814.0
10    645.0
Name: amount, dtype: float64

Use the mean for NaN values

In [29]:
incomplete_df['amount'].fillna(incomplete_df["amount"].mean())

0     345.0
1     928.0
2     618.0
3     645.0
4     113.0
5     942.0
6     618.0
7     539.0
8     618.0
9     814.0
10    618.0
Name: amount, dtype: float64

When filling NaN with groupby notice that since the 'average' of id 4 is NaN index 10 (the last row) th fillna value is NaN.

In [31]:
incomplete_df['amount'].fillna(incomplete_df.groupby("id")["amount"].transform("mean"), inplace=True)
incomplete_df

    id   type  amount
0    1    one   345.0
1    2    one   928.0
2    3    two   942.0
3    2  three   645.0
4    2    two   113.0
5    3  three   942.0
6    1    one   442.0
7    1    two   539.0
8    1    one   442.0
9    2  three   814.0
10   4    one     NaN